cf_billing/Documents/энргАктированиеНедопускаДопускаВПомещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргАктированиеНедопускаДопускаВПомещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика</xr:Item>
				<xr:Item>AccumulationRegister.энргНачисленныйСреднийОбъем</xr:Item>
				<xr:Item>InformationRegister.энргСостояниеДопускаВПомещение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПредоставлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеДопускаВПомещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеДопускаВПомещение</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Недопуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргАктированиеНедопускаДопускаВПомещение/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
КонецПроцедуры

#Область РеализацияИнтерфейса_РаботаСоСтабильнымиПериодыми

// Получает изменяемые параметры расчета.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;
	
	ИзменяемыеПараметры 		= Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи, Ресурсы", "ТочкаУчета", "КоличествоНедопусков, ПериодНачальногоНедопуска"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение, ИзменяемыеПараметры);
	
	ИзменяемыеПараметры 		= Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи, Ресурсы", "ТочкаУчета", "КоличествоНедопусков, ПериодНачальногоНедопуска"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение, ИзменяемыеПараметры);
		
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

// Получает данные для проведения по стабильным периодам.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт	
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовАктированиеНедопускаДопускаВПомещение";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодам());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			= "" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ЕстьЗначенияЗАполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		= Параметры.ключ.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргАктированиеНедопускаДопускаВПомещение",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргАктированиеНедопускаДопускаВПомещение",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы; 			
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргАктированиеНедопускаДопускаВПомещение",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	

		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента"	,"энргАктированиеНедопускаДопускаВПомещение");
			Параметры.вставить("ВыборОперации"	,Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Инициализирует данные документа.
//
// Параметры:
//  ДокументСсылка			-	ДокументСсылка.энргАктированиеНедопускаДопускаВПомещение.
//  ДополнительныеСвойства	-	Структура.
//  Регистры				-	Произвольный.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	
	ДобавитьТекстЗапросаАктированиеНедопускаДопускаВПомещение(Схема, Регистры);	
	ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема, Регистры);
	ДобавитьТекстЗапросаСостояниеВыполненияОбязанностейГарантирующегоПоставщика(Схема, Регистры);
	ДобавитьТекстЗапросаСторнированиеСреднегоОбъемаБезДопускаПодрядБольшеОпределенногоЧисла(Схема, Регистры);
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры = Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	ДанныеСтроения		= ДополнительныеСвойства.ДанныеСтроения;
	КлючиТаблицДвижений = энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  			= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Дата"					, ДополнительныеСвойства.Дата);
	Запрос.УстановитьПараметр("мДокументы"				, ДокументСсылка);
	Запрос.УстановитьПараметр("ЧастныйСектор"			, ДанныеСтроения.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение"				, ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("Помещение"				, ДанныеСтроения.Помещение);
	Запрос.УстановитьПараметр("Период"					, Новый Граница(ДополнительныеСвойства.МоментВремени, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("КолвоНедопусковПодряд"	, энргРаботаСКонстантами.ЗначениеКонстантыКоличествоНедопусковДляОтклоненияПоказаний());
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		энргФормированиеТекстовЗапроса.УстановитьПараметрыТаблицыПодмены(Запрос, ВспомогательныеПараметры); 
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

// Инициализирует таблицы для контроля.
//
// Параметры:
//  ДокументСсылка			-	ДокументСсылка.энргАктированиеНедопускаДопускаВПомещение.
//  ДополнительныеСвойства	-	Структура.
//
Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);
	ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры);
	ДобавитьТекстЗапросаКонтрольСостояниеЛицевогоСчета(Схема);
		
	КлючиТаблицКонтроля  						= Новый Структура;
			
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 									= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")),Сч);			
			Пакет.ТаблицаДляПомещения 			= "";
		КонецЕсли;		
	КонецЦикла;
	ТекстСообщенияМногоквартирныйДомЗакрыт 		= НСтр("ru = 'На дату операции мкд закрыт'");
	ТекстСообщенияЛицевойСчетЗакрыт 			= НСтр("ru = 'На дату операции лицевой счет закрыт'");
	ДанныеСтроения 								= ДополнительныеСвойства.ДанныеСтроения;
	
	Запрос  									= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 								ДокументСсылка);
	Запрос.УстановитьПараметр("ЧастныйСектор",								ДанныеСтроения.ЧастныйСектор);
	Запрос.УстановитьПараметр("Строение", 									ДанныеСтроения.Строение);
	Запрос.УстановитьПараметр("ТекстСообщенияМногоквартирныйДомЗакрыт", 	ТекстСообщенияМногоквартирныйДомЗакрыт);
	Запрос.УстановитьПараметр("ТекстСообщенияЛицевойСчетЗакрыт", 			ТекстСообщенияЛицевойСчетЗакрыт);
	
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 					Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 					КлючиТаблицКонтроля);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстДляПроведенияПоСтабильнымПериодам()	
	Текст 		=
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоНедопусков,
	|	ВЫБОР
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ДокументыДляПроведения.ПериодНачисления
	|	КОНЕЦ КАК ПериодНачальногоНедопуска,
	|	энргАктированиеНедопускаДопускаВПомещениеТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ДокументыДляПроведения.КлючПомещения КАК КлючПомещения,
	|	Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение) КАК ЭтоНеДопуск,
	|	Шапка.ВидОперации КАК ВидОперации
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргАктированиеНедопускаДопускаВПомещение КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргАктированиеНедопускаДопускаВПомещение.ТочкиУчета КАК энргАктированиеНедопускаДопускаВПомещениеТочкиУчета
	|		ПО ДокументыДляПроведения.ДокРегистратор = энргАктированиеНедопускаДопускаВПомещениеТочкиУчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеДопускаВПомещение.Период КАК Период,
	|	энргСостояниеДопускаВПомещение.Регистратор КАК Регистратор,
	|	энргСостояниеДопускаВПомещение.Организация КАК Организация,
	|	энргСостояниеДопускаВПомещение.Район КАК Район,
	|	энргСостояниеДопускаВПомещение.КлючПомещения КАК КлючПомещения,
	|	энргСостояниеДопускаВПомещение.ТочкаУчета КАК ТочкаУчета,
	|	энргСостояниеДопускаВПомещение.Недопуск КАК Недопуск,
	|	энргСостояниеДопускаВПомещение.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДокумента.ДатаРегистратора КАК ДатаРегистратора,
	|	ДанныеДокумента.ДокРегистратор КАК ДокРегистратор,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисленияТекущегоДокумента
	|ПОМЕСТИТЬ ИсторияСостоянияДопускаВПомещение
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеДопускаВПомещение КАК энргСостояниеДопускаВПомещение
	|		ПО ДанныеДокумента.Организация = энргСостояниеДопускаВПомещение.Организация
	|			И ДанныеДокумента.Район = энргСостояниеДопускаВПомещение.Район
	|			И ДанныеДокумента.КлючПомещения = энргСостояниеДопускаВПомещение.КлючПомещения
	|			И ДанныеДокумента.ТочкаУчета = энргСостояниеДопускаВПомещение.ТочкаУчета
	|			И (энргСостояниеДопускаВПомещение.Период <= ДанныеДокумента.ДатаРегистратора)
	|			И (ДанныеДокумента.ЭтоНеДопуск)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияСостоянияДопускаВПомещение.Организация КАК Организация,
	|	ИсторияСостоянияДопускаВПомещение.Район КАК Район,
	|	ИсторияСостоянияДопускаВПомещение.КлючПомещения КАК КлючПомещения,
	|	ИсторияСостоянияДопускаВПомещение.ТочкаУчета КАК ТочкаУчета,
	|	СУММА(ИсторияСостоянияДопускаВПомещение.Недопуск) КАК КоличествоНедопусков,
	|	МИНИМУМ(ИсторияСостоянияДопускаВПомещение.ПериодНачисления) КАК ПериодНачисления
	|ПОМЕСТИТЬ ПредыдущееКоличествоНедопусков
	|ИЗ
	|	ИсторияСостоянияДопускаВПомещение КАК ИсторияСостоянияДопускаВПомещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ЕСТЬNULL(ИсторияСостоянияДопускаВПомещение.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК Период,
	|			ДанныеДокумента.Организация КАК Организация,
	|			ДанныеДокумента.Район КАК Район,
	|			ДанныеДокумента.КлючПомещения КАК КлючПомещения,
	|			ДанныеДокумента.ТочкаУчета КАК ТочкаУчета
	|		ИЗ
	|			ДанныеДокумента КАК ДанныеДокумента
	|				ЛЕВОЕ СОЕДИНЕНИЕ ИсторияСостоянияДопускаВПомещение КАК ИсторияСостоянияДопускаВПомещение
	|				ПО ДанныеДокумента.Организация = ИсторияСостоянияДопускаВПомещение.Организация
	|					И ДанныеДокумента.Район = ИсторияСостоянияДопускаВПомещение.Район
	|					И ДанныеДокумента.КлючПомещения = ИсторияСостоянияДопускаВПомещение.КлючПомещения
	|					И ДанныеДокумента.ТочкаУчета = ИсторияСостоянияДопускаВПомещение.ТочкаУчета
	|					И ИсторияСостоянияДопускаВПомещение.Недопуск = 0
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДанныеДокумента.КлючПомещения,
	|			ДанныеДокумента.Район,
	|			ДанныеДокумента.Организация,
	|			ДанныеДокумента.ТочкаУчета) КАК ДатаДопускаВПомещение
	|		ПО ИсторияСостоянияДопускаВПомещение.Организация = ДатаДопускаВПомещение.Организация
	|			И ИсторияСостоянияДопускаВПомещение.Район = ДатаДопускаВПомещение.Район
	|			И ИсторияСостоянияДопускаВПомещение.КлючПомещения = ДатаДопускаВПомещение.КлючПомещения
	|			И ИсторияСостоянияДопускаВПомещение.ТочкаУчета = ДатаДопускаВПомещение.ТочкаУчета
	|			И (НЕ ИсторияСостоянияДопускаВПомещение.Недопуск = 0)
	|			И (ВЫБОР
	|				КОГДА ИсторияСостоянияДопускаВПомещение.Период >= ДатаДопускаВПомещение.Период
	|						И ИсторияСостоянияДопускаВПомещение.Период <= ИсторияСостоянияДопускаВПомещение.ДатаРегистратора
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (НЕ ИсторияСостоянияДопускаВПомещение.Регистратор = ИсторияСостоянияДопускаВПомещение.ДокРегистратор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияСостоянияДопускаВПомещение.Организация,
	|	ИсторияСостоянияДопускаВПомещение.КлючПомещения,
	|	ИсторияСостоянияДопускаВПомещение.ТочкаУчета,
	|	ИсторияСостоянияДопускаВПомещение.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеДокумента.Район КАК Район,
	|	ДанныеДокумента.ЧастныйСектор КАК ЧастныйСектор,
	|	ДанныеДокумента.Строение КАК Строение,
	|	ДанныеДокумента.Помещение КАК Помещение,
	|	ДанныеДокумента.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеДокумента.ДатаРегистратора КАК ДатаРегистратора,
	|	ДанныеДокумента.ДокРегистратор КАК ДокРегистратор,
	|	ДанныеДокумента.КоличествоНедопусков + ЕСТЬNULL(ПредыдущееКоличествоНедопусков.КоличествоНедопусков, 0) КАК КоличествоНедопусков,
	|	ДанныеДокумента.ТочкаУчета КАК ТочкаУчета,
	|	ДанныеДокумента.КлючПомещения КАК КлючПомещения,
	|	ЕСТЬNULL(ПредыдущееКоличествоНедопусков.ПериодНачисления, ДанныеДокумента.ПериодНачальногоНедопуска) КАК ПериодНачальногоНедопуска,
	|	ДанныеДокумента.ВидОперации КАК ВидОперации
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредыдущееКоличествоНедопусков КАК ПредыдущееКоличествоНедопусков
	|		ПО ДанныеДокумента.Организация = ПредыдущееКоличествоНедопусков.Организация
	|			И ДанныеДокумента.Район = ПредыдущееКоличествоНедопусков.Район
	|			И ДанныеДокумента.КлючПомещения = ПредыдущееКоличествоНедопусков.КлючПомещения
	|			И ДанныеДокумента.ТочкаУчета = ПредыдущееКоличествоНедопусков.ТочкаУчета";
	
	Возврат Текст;

КонецФункции

#Область РеализацияИнтерфейса_Проведение

Процедура ДобавитьТекстЗапросаАктированиеНедопускаДопускаВПомещение(Схема, Регистры)
	
	ИмяРегистра = "энргСостояниеДопускаВПомещение";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргАктированиеНедопускаДопускаВПомещение.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргАктированиеНедопускаДопускаВПомещение.ДатаФактическогоСобытия
	|		ИНАЧЕ энргАктированиеНедопускаДопускаВПомещение.Дата
	|	КОНЕЦ КАК Период,
	|	энргАктированиеНедопускаДопускаВПомещение.Организация КАК Организация,
	|	энргАктированиеНедопускаДопускаВПомещение.Район КАК Район,
	|	энргАктированиеНедопускаДопускаВПомещение.КлючПомещения КАК КлючПомещения,
	|	энргАктированиеНедопускаДопускаВПомещениеТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	энргАктированиеНедопускаДопускаВПомещениеТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	энргАктированиеНедопускаДопускаВПомещение.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(энргАктированиеНедопускаДопускаВПомещение.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	ВЫБОР
	|		КОГДА энргАктированиеНедопускаДопускаВПомещение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Недопуск
	|ИЗ
	|	Документ.энргАктированиеНедопускаДопускаВПомещение КАК энргАктированиеНедопускаДопускаВПомещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргАктированиеНедопускаДопускаВПомещение.ТочкиУчета КАК энргАктированиеНедопускаДопускаВПомещениеТочкиУчета
	|		ПО энргАктированиеНедопускаДопускаВПомещение.Ссылка = энргАктированиеНедопускаДопускаВПомещениеТочкиУчета.Ссылка
	|			И (энргАктированиеНедопускаДопускаВПомещение.Ссылка В (&мДокументы))
	|			И (энргАктированиеНедопускаДопускаВПомещениеТочкиУчета.Ссылка В (&мДокументы))
	|			И (НЕ энргАктированиеНедопускаДопускаВПомещениеТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема,Регистры)
	
	ИмяРегистра 	= "энргПоказанияПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	табПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	0 КАК Разделитель,
	|	ВЫБОР
	|		КОГДА энргПриборыУчетаАбонента.РегистрируетОбъем
	|			ТОГДА табПоказанияПриборовУчета.Разница
	|		ИНАЧЕ табПоказанияПриборовУчета.ТекущиеПоказания
	|	КОНЕЦ КАК Показание,
	|	ЗНАЧЕНИЕ(Перечисление.энргСостояниеПоказаний.Приняты) КАК СостояниеПоказаний,
	|	ЛОЖЬ КАК КС,
	|	ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.ПустаяСсылка) КАК ИсточникПоказаний,
	|	ЛОЖЬ КАК Переворот,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	табПоказанияПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		табШкалыПриборовУчета.IDСтроки КАК IDСтроки,
	|		табШкалыПриборовУчета.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(Шапка.ДатаФактическогоСобытия, ДЕНЬ)
	|				ИНАЧЕ Шапка.Дата
	|			КОНЕЦ КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			табТочкиУчета.ПриборУчета КАК ПриборУчета,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|			табТочкиУчета.IDСтроки КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор
	|		ИЗ
	|			Документ.энргАктированиеНедопускаДопускаВПомещение КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргАктированиеНедопускаДопускаВПомещение.ТочкиУчета КАК табТочкиУчета
	|				ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (табТочкиУчета.Ссылка В (&мДокументы))
	|					И (НЕ табТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргАктированиеНедопускаДопускаВПомещение.ШкалыПриборовУчета КАК табШкалыПриборовУчета
	|			ПО ВложенныйЗапрос.Регистратор = табШкалыПриборовУчета.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = табШкалыПриборовУчета.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргАктированиеНедопускаДопускаВПомещение.ПоказанияПриборовУчета КАК табПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = табПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = табПоказанияПриборовУчета.IDСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ВложенныйЗапрос.ПриборУчета = энргПриборыУчетаАбонента.Ссылка"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСостояниеВыполненияОбязанностейГарантирующегоПоставщика(Схема, Регистры)
		
	ИмяРегистра = "энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	=
	"ВЫБРАТЬ
	|	табШапка.Дата КАК Период,
	|	табШапка.Организация КАК Организация,
	|	табШапка.Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	&Строение КАК Строение,
	|	&Помещение КАК Помещение,
	|	табШапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	табШапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(табШапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	ИСТИНА КАК ОбязанностиВыполнены
	|ИЗ
	|	Документ.энргАктированиеНедопускаДопускаВПомещение КАК табШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргАктированиеНедопускаДопускаВПомещение.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ПО (табШапка.Ссылка В (&мДокументы))
	|			И (табШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение))
	|			И табШапка.Ссылка = ТаблицаТочкиУчета.Ссылка";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаСторнированиеСреднегоОбъемаБезДопускаПодрядБольшеОпределенногоЧисла(Схема, Регистры)
		
	ИмяРегистра = "энргНачисленныйСреднийОбъем";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	=
	"ВЫБРАТЬ
	|	табШапка.Дата КАК Период,
	|	табШапка.Организация КАК Организация,
	|	табШапка.Район КАК Район,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	&Строение КАК Строение,
	|	&Помещение КАК Помещение,
	|	табШапка.КлючПомещения КАК КлючПомещения,
	|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	табШапка.Абонент КАК Абонент
	|ПОМЕСТИТЬ ТочкиНедопускаПоДокументу
	|ИЗ
	|	Документ.энргАктированиеНедопускаДопускаВПомещение КАК табШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргАктированиеНедопускаДопускаВПомещение.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ПО (табШапка.Ссылка В (&мДокументы))
	|			И (табШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение))
	|			И табШапка.Ссылка = ТаблицаТочкиУчета.Ссылка";
	
	Пакет.УстановитьТекстЗапроса(Текст); 	
	
	ВспомогательнаяСхема = Новый СхемаЗапроса;	
	ТекстКоличестваНеДопуска = РегистрыСведений.энргСостояниеДопускаВПомещение.ТекстЗапросаПриборыБезДопускаПодрядБольшеОпределенногоЧисла("ТочкиНедопускаПоДокументу");
	ТекстКоличестваНеДопуска = СтрЗаменить(
		ТекстКоличестваНеДопуска,
		"СУММА(энргСостояниеДопускаВПомещение.Недопуск) >= &КолвоНедопусковПодряд",
		"СУММА(энргСостояниеДопускаВПомещение.Недопуск) + 1 >= &КолвоНедопусковПодряд");
	ВспомогательнаяСхема.УстановитьТекстЗапроса(ТекстКоличестваНеДопуска);
	
	Для Каждого ТекПакетЗапроса из ВспомогательнаяСхема.ПакетЗапросов Цикл 
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		Пакет.УстановитьТекстЗапроса(ТекПакетЗапроса.ПолучитьТекстЗапроса());
	КонецЦикла; 	
	
	Текст  	=
	"ВЫБРАТЬ
	|	ТочкиНедопускаПоДокументу.Период КАК Период,
	|	ТочкиНедопускаПоДокументу.Организация КАК Организация,
	|	ТочкиНедопускаПоДокументу.Район КАК Район,
	|	ТочкиНедопускаПоДокументу.ЧастныйСектор КАК ЧастныйСектор,
	|	ТочкиНедопускаПоДокументу.Строение КАК Строение,
	|	ТочкиНедопускаПоДокументу.Помещение КАК Помещение,
	|	ТочкиНедопускаПоДокументу.Абонент КАК Абонент,
	|	ТочкиНедопускаПоДокументу.КлючПомещения КАК КлючПомещения,
	|	ТочкиНедопускаПоДокументу.ТочкаУчета КАК ТочкаУчета,
	|	ТочкиНедопускаПоДокументу.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ТочкиСписанияСреднего
	|ИЗ
	|	ТочкиНедопускаПоДокументу КАК ТочкиНедопускаПоДокументу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриборыСНЕДопуском КАК ПриборыСНЕДопуском
	|		ПО ТочкиНедопускаПоДокументу.Организация = ПриборыСНЕДопуском.Организация
	|			И ТочкиНедопускаПоДокументу.Район = ПриборыСНЕДопуском.Район
	|			И ТочкиНедопускаПоДокументу.КлючПомещения = ПриборыСНЕДопуском.КлючПомещения
	|			И ТочкиНедопускаПоДокументу.ПриборУчета = ПриборыСНЕДопуском.ПриборУчета";
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(Текст);
	
	ПараметрыОтбора	 = Новый Структура;
	ПараметрыВТ 	 = Новый Массив;
	
	СоотвествиеПолей = Новый Структура(
		"Организация,Район,ЧастныйСектор,Строение,Помещение,Абонент,ТочкаУчета",
		"Организация", "Район", "ЧастныйСектор", "Строение", "Помещение", "Абонент", "ТочкаУчета");
	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица("ТочкиСписанияСреднего", СоотвествиеПолей));
	
	ПараметрыОтбора.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));	
	ПараметрыОтбора.Вставить("ПараметрыВТ", ПараметрыВТ);	
	РегистрыНакопления.энргНачисленныйСреднийОбъем.ЗаполнитьСхемуЗапросаОстатками(Схема, ПараметрыОтбора, "ОстаткиСреднегоОбъема");	
	
	Текст  	=
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ОстаткиСреднегоОбъема.Организация КАК Организация,
	|	ОстаткиСреднегоОбъема.Район КАК Район,
	|	ОстаткиСреднегоОбъема.ЧастныйСектор КАК ЧастныйСектор,
	|	ОстаткиСреднегоОбъема.Строение КАК Строение,
	|	ОстаткиСреднегоОбъема.Помещение КАК Помещение,
	|	ОстаткиСреднегоОбъема.Абонент КАК Абонент,
	|	ОстаткиСреднегоОбъема.ПериодНачисления КАК ПериодНачисления,
	|	ОстаткиСреднегоОбъема.ТочкаУчета КАК ТочкаУчета,
	|	ОстаткиСреднегоОбъема.Услуга КАК Услуга,
	|	ОстаткиСреднегоОбъема.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ОстаткиСреднегоОбъема.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ОстаткиСреднегоОбъема.ТарифнаяГруппа КАК ТарифнаяГруппа,
	|	ОстаткиСреднегоОбъема.ПриборУчета КАК ПриборУчета,
	|	ОстаткиСреднегоОбъема.Шкала КАК Шкала,
	|	ОстаткиСреднегоОбъема.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОстаткиСреднегоОбъема.Поставщик КАК Поставщик,
	|	ОстаткиСреднегоОбъема.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
	|	ОстаткиСреднегоОбъема.ПриборЗависимой КАК ПриборЗависимой,
	|	ОстаткиСреднегоОбъема.СпособНачисления КАК СпособНачисления,
	|	ОстаткиСреднегоОбъема.СверхНорматива КАК СверхНорматива,
	|	ОстаткиСреднегоОбъема.Сумма КАК Сумма,
	|	ОстаткиСреднегоОбъема.ОбъемУслуги КАК ОбъемУслуги,
	|	ОстаткиСреднегоОбъема.ОбъемУслугиПотребленный КАК ОбъемУслугиПотребленный,
	|	ОстаткиСреднегоОбъема.ОбъемУслугиПотери КАК ОбъемУслугиПотери,
	|	ОстаткиСреднегоОбъема.ОбъемУслугиПотребленныйПотери КАК ОбъемУслугиПотребленныйПотери,
	|	ОстаткиСреднегоОбъема.ПомещениеРодитель КАК ПомещениеРодитель
	|ИЗ
	|	ОстаткиСреднегоОбъема КАК ОстаткиСреднегоОбъема
	|ГДЕ
	|	(ОстаткиСреднегоОбъема.Сумма > 0
	|			ИЛИ ОстаткиСреднегоОбъема.ОбъемУслуги > 0
	|			ИЛИ ОстаткиСреднегоОбъема.ОбъемУслугиПотребленный > 0
	|			ИЛИ ОстаткиСреднегоОбъема.ОбъемУслугиПотери > 0
	|			ИЛИ ОстаткиСреднегоОбъема.ОбъемУслугиПотребленныйПотери > 0)";
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтерфейса_КонтрольПроведения

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
	"ВЫБРАТЬ
	|	энргАктированиеНедопускаДопускаВПомещение.Ссылка КАК Ссылка,
	|	энргАктированиеНедопускаДопускаВПомещение.Организация КАК Организация,
	|	энргАктированиеНедопускаДопускаВПомещение.Район КАК Район,
	|	энргАктированиеНедопускаДопускаВПомещение.Абонент КАК Абонент,
	|	ВЫБОР
	|		КОГДА &ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.пустаяСсылка)
	|		ИНАЧЕ &Строение
	|	КОНЕЦ КАК МКД,
	|	ВЫБОР
	|		КОГДА НЕ энргАктированиеНедопускаДопускаВПомещение.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргАктированиеНедопускаДопускаВПомещение.ДатаФактическогоСобытия
	|		ИНАЧЕ энргАктированиеНедопускаДопускаВПомещение.Дата
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ПараметрыКонтроля
	|ИЗ
	|	Документ.энргАктированиеНедопускаДопускаВПомещение КАК энргАктированиеНедопускаДопускаВПомещение
	|ГДЕ
	|	энргАктированиеНедопускаДопускаВПомещение.Ссылка В(&мДокументы)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра,ТаблицаИсточник,ТипПараметра,СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,МКД","Организация","Район","МКД")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеМКД.СостояниеМногоквартирногоДома(Схема,ПараметрыСостоянияМКД,"СостояниеМногоквартирногоДома");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияМногоквартирныйДомЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеМногоквартирногоДома КАК СостояниеМногоквартирногоДома
	|		ПО ПараметрыКонтроля.Организация = СостояниеМногоквартирногоДома.Организация
	|			И ПараметрыКонтроля.Район = СостояниеМногоквартирногоДома.Район
	|			И ПараметрыКонтроля.МКД = СостояниеМногоквартирногоДома.МКД
	|ГДЕ
	|	НЕ &ЧастныйСектор
	|	И (НЕ ЕСТЬNULL(СостояниеМногоквартирногоДома.Состояние, ЛОЖЬ)
	|			ИЛИ КОНЕЦПЕРИОДА(ПараметрыКонтроля.Период, ДЕНЬ) < ЕСТЬNULL(КОНЕЦПЕРИОДА(СостояниеМногоквартирногоДома.Период, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеМКД";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКонтрольСостояниеЛицевогоСчета(Схема)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра,ТаблицаИсточник, ТипПараметра, СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,Абонент","Организация","Район","Абонент")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеЛС.СостояниеЛицевогоСчета(Схема,ПараметрыСостоянияМКД,"СостояниеЛицевогоСчета");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияЛицевойСчетЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеЛицевогоСчета КАК СостояниеЛицевогоСчета
	|		ПО ПараметрыКонтроля.Организация = СостояниеЛицевогоСчета.Организация
	|			И ПараметрыКонтроля.Район = СостояниеЛицевогоСчета.Район
	|			И ПараметрыКонтроля.Абонент = СостояниеЛицевогоСчета.Абонент
	|ГДЕ
	|	НЕ ПараметрыКонтроля.Абонент = ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)
	|	И (НЕ ЕСТЬNULL(СостояниеЛицевогоСчета.Состояние, ЛОЖЬ)
	|			ИЛИ ПараметрыКонтроля.Период < ЕСТЬNULL(СостояниеЛицевогоСчета.Период, ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеЛС";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
